Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape Data 

- Objective 01 - concatenate data using the pandas concat method
- Objective 02 - merge data using pandas merge
- Objective 03 - define the concept of tidy data and describe the format
- Objective 04 - transition between tidy and wide data formats with `melt()` and `pivot()`

Helpful Links:
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables

# [Objective 1](#concat) - Concatenate dataframes with pandas

## Overview

"Concatenate" is a fancy word for joining two things together. For example, we can concatenate two strings together using the `+` operator.

In [2]:
'We can join/concatenate two strings together ' + 'using the "+" operator.'

'We can join/concatenate two strings together using the "+" operator.'

When we "concatenate" two dataframes we will "stick them together" either by rows or columns. Lets look at some simple examples:

In [3]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'a': [1,2,3,4], 'b': [4,5,6,7], 'c': [7,8,9,10]})
df2 = pd.DataFrame({'a': [6,4,8,7], 'b': [9,4,3,2], 'c': [1,6,2,9]})

In [5]:
df1.head()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10

In [6]:
df2.head()

   a  b  c
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9

### Concatenate by Rows 

concatenating by rows is the default behavior of `pd.concat()` This is often the most common form of concatenation.

In [7]:
by_rows = pd.concat([df1,df2])
by_rows

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
0  6  9   1
1  4  4   6
2  8  3   2
3  7  2   9

In [8]:
by_rows.reset_index()

   index  a  b   c
0      0  1  4   7
1      1  2  5   8
2      2  3  6   9
3      3  4  7  10
4      0  6  9   1
5      1  4  4   6
6      2  8  3   2
7      3  7  2   9

### Concatenate by Columns

In [9]:
by_columns=pd.concat([df1,df2],axis=1)
by_columns

   a  b   c  a  b  c
0  1  4   7  6  9  1
1  2  5   8  4  4  6
2  3  6   9  8  3  2
3  4  7  10  7  2  9

In [10]:
by_columns['a']

   a  a
0  1  6
1  2  4
2  3  8
3  4  7

In [11]:
# rename columns
by_columns.columns= ['a1','b1','c1','a2','b2','c2']
by_columns

   a1  b1  c1  a2  b2  c2
0   1   4   7   6   9   1
1   2   5   8   4   4   6
2   3   6   9   8   3   2
3   4   7  10   7   2   9

[

In [12]:
by_columns['a1']

0    1
1    2
2    3
3    4
Name: a1, dtype: int64

When concatenating dataframes, it is done using the column headers and row index values to match rows up. If these don't match up, then `NaN` values will be added where matches can't be found.

In [13]:
df3 = pd.DataFrame({'a': [4,3,2,1], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df4 = pd.DataFrame({'a': [6,4,8,7,8], 'b': [9,4,3,2,1], 'd': [1,6,2,9,5]})

In [14]:
df3.head()

   a  b   c
0  4  4   7
1  3  5   8
2  2  6   9
3  1  7  10

In [15]:
df4.head()

   a  b  d
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9
4  8  1  5

In [16]:
df3+df4

      a     b   c   d
0  10.0  13.0 NaN NaN
1   7.0   9.0 NaN NaN
2  10.0   9.0 NaN NaN
3   8.0   9.0 NaN NaN
4   NaN   NaN NaN NaN

### Concatenate by rows when not all column headers match

In [17]:
by_rows2 = pd.concat([df3,df4])

### Concatenate by columns when not all row indexes match

In [18]:
by_cols2 = pd.concat([df3,df4])

Whenever we are combining dataframes, if appropriate values cannot be found based on the rules of the method we are using, then missing values will be filled with `NaNs`.

## Follow Along

We’ll work with a dataset of [3 Million Instacart Orders, Open Sourced](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2)!

The files that we will be working with are in a folder of CSVs, we need to load that folder of CSVs, explore the CSVs to make sure that we understand what we're working with, and where the important data lies, and then work to combine the dataframes together as necessary. 



Our goal is to reproduce this table which holds the first two orders for user id 1.

In [19]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [20]:
#!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz 

# Make sure we're in the top-level /content directory
#
# See below for notes on the cd command and why it's %cd instead of !cd
%cd /content

# Remove everything in the current working directory
#
# rm is the remove command
# -rf specifies the "recursive" and "force" options to remove all files in 
# subdirectories without prompting
#
# THIS IS A POWERFUL COMMAND! (NEVER RUN THIS COMMAND ON YOUR COMPUTER)
#
# In this particular case, removing all of the files makes things easier if you
# need to re-run these examples by allowing you start with a clean directory
# every time.
!rm -rf *

# wget retrieves files from a remote location
!wget https://www.dropbox.com/s/pofcl26lvoj6073/instacart-market-basket-analysis.zip

/content
--2020-11-03 03:47:06--  https://www.dropbox.com/s/pofcl26lvoj6073/instacart-market-basket-analysis.zip
Resolving www.dropbox.com (www.dropbox.com)... 162.125.65.1, 2620:100:6021:1::a27d:4101
Connecting to www.dropbox.com (www.dropbox.com)|162.125.65.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/pofcl26lvoj6073/instacart-market-basket-analysis.zip [following]
--2020-11-03 03:47:07--  https://www.dropbox.com/s/raw/pofcl26lvoj6073/instacart-market-basket-analysis.zip
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com/cd/0/inline/BCf_NDQqjUlip8T1qzg_UNdeGZD-1X4oR83FJ_w9ViGCUmIpwbyYkyAZd36OvH7_3YI8kB-nW7XZ4AbAJMgBJJZXplM3cLFMqAwXPWMpFOSf3h24_0zxFPsWkp7pCBHNPNg/file# [following]
--2020-11-03 03:47:07--  https://ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com/cd/0/inline/BCf_NDQqjUlip8T1qzg_UNdeGZD-1X4oR83FJ_w9ViGCUmIpwbyYkyAZd36OvH7_3YI8kB-nW7XZ4AbAJMgBJJZXplM3cLFMqAwXPWMpFOSf3h24_0zxFPsWkp7pCBHNPNg/file
Resolving ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com (ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com)... 162.125.65.15, 2620:100:6021:15::a27d:410f
Connecting to ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com (ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com)|162.125.65.15|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: /cd/0/inline2/BCfVAy8ba2gVaVdkZS5WMMp2DXUpnDbHzTfyf9JtIVQasRCpt9Eq4rulB4tB4yv2vvKs_gpTgg_CfxCPPUcNmzzQOO5mBrPNYDHtBpuZnC5wY07ecHfCD4ft55OMlHn62g3-bihqRKoom2TwDBXksaKZ_14J2VQsVINLIoQ3HlmXp3rxvjI0Ej_uvPV5FAgNmejaIBAat9yp5nAM3RkQZQrYcVbM5S83IO0ligjRJHJYtu6jZofKAVIsAFsT4p7rOIPqUm3opjmkLbWSmJcMUVgJVNUANAZB7cj00yOTB_u0M9zPqYKtfaqd3ctqXnffhpnG0Mwk-j4i9rCxL-AnuVGpbI1Nf-_BRogGx5iccxHRsQ/file [following]
--2020-11-03 03:47:08--  https://ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com/cd/0/inline2/BCfVAy8ba2gVaVdkZS5WMMp2DXUpnDbHzTfyf9JtIVQasRCpt9Eq4rulB4tB4yv2vvKs_gpTgg_CfxCPPUcNmzzQOO5mBrPNYDHtBpuZnC5wY07ecHfCD4ft55OMlHn62g3-bihqRKoom2TwDBXksaKZ_14J2VQsVINLIoQ3HlmXp3rxvjI0Ej_uvPV5FAgNmejaIBAat9yp5nAM3RkQZQrYcVbM5S83IO0ligjRJHJYtu6jZofKAVIsAFsT4p7rOIPqUm3opjmkLbWSmJcMUVgJVNUANAZB7cj00yOTB_u0M9zPqYKtfaqd3ctqXnffhpnG0Mwk-j4i9rCxL-AnuVGpbI1Nf-_BRogGx5iccxHRsQ/file
Reusing existing connection to ucb906f6ca66fe28bea9799c888e.dl.dropboxusercontent.com:443.
HTTP request sent, awaiting response... 200 OK
Length: 205616541 (196M) [application/zip]
Saving to: ‘instacart-market-basket-analysis.zip’

instacart-market-ba 100%[===================>] 196.09M  27.3MB/s    in 8.5s

2020-11-03 03:47:17 (23.1 MB/s) - ‘instacart-market-basket-analysis.zip’ saved [205616541/205616541]

In [21]:
# Unzip the archive
#
# Creates a new directory called instacart-market-basket-analysis

!unzip instacart-market-basket-analysis.zip

Archive:  instacart-market-basket-analysis.zip
   creating: instacart-market-basket-analysis/
  inflating: __MACOSX/._instacart-market-basket-analysis
  inflating: instacart-market-basket-analysis/order_products__prior.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._order_products__prior.csv.zip
  inflating: instacart-market-basket-analysis/.DS_Store
  inflating: __MACOSX/instacart-market-basket-analysis/._.DS_Store
  inflating: instacart-market-basket-analysis/order_products__train.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._order_products__train.csv.zip
  inflating: instacart-market-basket-analysis/aisles.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._aisles.csv.zip
  inflating: instacart-market-basket-analysis/orders.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._orders.csv.zip
  inflating: instacart-market-basket-analysis/departments.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._departments.csv.zip
  inflating: instacart-market-basket-analysis/products.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._products.csv.zip

In [76]:
!rm -rf *.zip

In [22]:
# Change into the newly-unzipped directory
#
# % sign is required to change to a new directory -- you can't use !cd like
# other commands
#
# Optional technical details:
#
# % makes the command apply to the **entire notebook environment**, which is
# what you need to do to change the working directory
#
# The ! sign **opens a new shell process** behind the scenes to execute the
# command -- this works fine for regular commands like unzip and ls
#
# Therefore, !cd would apply only to that new shell and wouldn't change the
# global notebook environment
#
# If this makes your heard hurt, don't worry too much about it. We'll talk
# more about the shell and operating systems stuff later in the program.

%cd instacart-market-basket-analysis

/content/instacart-market-basket-analysis

In [23]:
# Unzip all .csv.zip files in the directory
!unzip "*.zip"

Archive:  order_products__train.csv.zip
  inflating: order_products__train.csv
   creating: __MACOSX/
  inflating: __MACOSX/._order_products__train.csv

Archive:  aisles.csv.zip
  inflating: aisles.csv
  inflating: __MACOSX/._aisles.csv

Archive:  orders.csv.zip
  inflating: orders.csv
  inflating: __MACOSX/._orders.csv

Archive:  departments.csv.zip
  inflating: departments.csv
  inflating: __MACOSX/._departments.csv

Archive:  order_products__prior.csv.zip
  inflating: order_products__prior.csv
  inflating: __MACOSX/._order_products__prior.csv

Archive:  products.csv.zip
  inflating: products.csv
  inflating: __MACOSX/._products.csv

6 archives were successfully processed.

In [24]:
# List all csv files in the current directory
# -l specifies the "long" listing format, which includes additional info on each file
# -h specifies "human readable" file size units
!ls -l -h *.csv

-rw-r--r-- 1 root root 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 root root  270 May  2  2017 departments.csv
-rw-r--r-- 1 root root 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 root root  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 root root 104M May  2  2017 orders.csv
-rw-r--r-- 1 root root 2.1M May  2  2017 products.csv

In [25]:
display(example)

### aisles

We don't need anything from aisles.csv

In [26]:
aisles = pd.read_csv('aisles.csv')

print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

### departments

We don't need anything from departments.csv

In [27]:
departments = pd.read_csv('departments.csv')

print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

### order_products__prior

We need:
- order id
- proudct id
- add to cart order

Everything except for 'reordered'

In [28]:
order_products__prior = pd.read_csv('order_products__prior.csv')

print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

### order_products__train

We need:
- order id
- proudct id
- add to cart order

Everything except for 'reordered'

Do you see anything similar between order_products__train and order_products__prior?

In [29]:
order_products__train = pd.read_csv('order_products__train.csv')

print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

### orders

We need:
- order id
- user id
- order number
- order dow
- order hour of day

In [30]:
orders = pd.read_csv('orders.csv')

print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

### products

We need:
- product id
- product name

In [31]:
products = pd.read_csv('products.csv')

print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

## Concatenate order_products__prior and order_products__train

In [32]:
order_products = pd.concat([order_products__prior, order_products__train])

order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [33]:
print(order_products__prior.shape)
print(order_products__train.shape)

(32434489, 4)
(1384617, 4)

In [34]:
print(order_products.shape)

(33819106, 4)

## Challenge

Concatenating dataframes means to stick two dataframes together either by rows or by columns. The default behavior of `pd.concat()` is to take the rows of one dataframe and add them to the rows of another dataframe. If we pass the argument `axis=1` then we will be adding the columns of one dataframe to the columns of another dataframe.

Concatenating dataframes is most useful when the columns are the same between two dataframes or when we have matching row indices between two dataframes. 

Be ready to use this method to combine dataframes together during your assignment.

# [Objective 2](#merge) - Merge dataframes with pandas

## Overview

In [35]:
display(example)

Before we can continue we need to understand where the data in the above table is coming from and what why specific pieces of data are held in the specific dataframes.

Each of these CSVs has a specific unit of observation (row). The columns that we see included in each CSV were selected purposefully. For example, everything each row of the `orders` dataframe is a specific and unique order -telling us who made the order, and when they made it. Every row in the `products` dataframe tells us about a specific and unique product that thestore offers. And everything in the `order_products` dataframe tells us about how products are associated with specific orders -including when the product was added to the shopping cart. 

### The Orders Dataframe

Holds information about specific orders, things like who placed the order, what 

- user_id
- order_id
- order_number
- order_dow
- order_hour_of_day

### The Products Dataframe

Holds information about individual products.

- product_id
- product_name

### The Order_Products Dataframe

Tells us how products are associated with specific orders since an order is a group of products.

- order_id
- product_id
- add_to_cart_order

As we look at the table that we're trying to recreate, we notice that we're not looking at specific orders or products, but at a specific **USER**. We're looking at the first two orders for a specific user and the products associated with those orders, so we'll need to combine dataframes to get all of this data together into a single table.

**The key to combining all of this information is that we need values that exist in both datasets that we can use to match up rows and combine dataframes.**

## Follow Along

We have two dataframes, so we're going to need to merge our data twice. As we approach merging datasets together we will take the following approach.

1) Identify which to dataframes we would like to combine.

2) Find columns that are common between both dataframes that we can use to match up information.

3) Slim down both of our dataframes so that they only relevant data before we merge.

4) Merge the dataframes.

In [36]:
merge_one = pd.merge(order_products, orders,how='inner',on='order_id')

In [1]:
all_info = pd.merge(merge_one, products, how='inner',on='product_id')
all_info.head()

NameError: ignored

## ^^^^^ DON'T DO THIS!

I just merged absolutely everything

### First Merge

1) Combine `orders` and `order_products`

2) We will use the `order_id` column to match information between the two datasets

3) Lets slim down our dataframes to only the information that we need. We do this because the merge process is complex. Why would we merge millions of rows together if we know that we're only going to need 11 rows when we're done

What specific conditions could we use to slim down the `orders` dataframe?

`user_id == 1` and `order_id <=2`

or

`order_id == 2539329` and `order_id == 2398795`

In [40]:
# An example of dataframe filtering

# Create a condition
condition = orders['order_id'] <5
# Pass that condition into the square brackets 
# that we use to access portions of a dataframe
# only the rows where that condition evaluates to *TRUE*
# will be retained in the dataframe
orders[condition]
# Look at the subsetted dataframe

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
1868044         1   112108  ...                10                     9.0
2958007         4   178520  ...                 9                     7.0
3355525         2   202279  ...                 9                     8.0
3417191         3   205970  ...                17                    12.0

[4 rows x 7 columns]

In [41]:
display(example)

In [42]:
# We don't necessarily have to save our condition to the variable "condition"
# we can pass the condition into the square brackest directly
# I just wanted to be clear what was happening inside of the square brackets
orders[orders['order_id'] <5]
# orders[0:10,0:5]

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
1868044         1   112108  ...                10                     9.0
2958007         4   178520  ...                 9                     7.0
3355525         2   202279  ...                 9                     8.0
3417191         3   205970  ...                17                    12.0

[4 rows x 7 columns]

In [44]:
condition = (orders['user_id']<=2) & (orders['order_number'] <=2)

In [47]:
orders_subset = orders[condition]
orders_subset

    order_id  user_id  ... order_hour_of_day  days_since_prior_order
0    2539329        1  ...                 8                     NaN
1    2398795        1  ...                 7                    15.0
11   2168274        2  ...                11                     NaN
12   1501582        2  ...                10                    10.0

[4 rows x 7 columns]

In [ ]:
# Filter based on user_id and order_number
# AND condition version 
# I need to use the "bitwise" and operator: &

Remember there are multiple ways that we could have filtered this dataframe. We also could have done it by specific `order_id`s

In [49]:
# use the bitwise "or" operator: |
condition = (orders['order_id']==2539329) | (orders['order_id']==2398795)
orders_subset = orders[condition]
orders_subset

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0

[2 rows x 7 columns]

Now we'll filter down the order_products dataframe

What conditions could we use for subsetting that table?

We can use order_id again.

In [50]:
condition = (order_products['order_id']==2539329) | (order_products['order_id']==2398795)
order_products_subset = order_products[condition]

4) Now we're ready to merge these two tables together.

In [53]:
order_and_products = pd.merge(orders_subset, order_products, on='order_id')
order_and_products

    order_id  user_id eval_set  ...  product_id  add_to_cart_order  reordered
0    2539329        1    prior  ...         196                  1          0
1    2539329        1    prior  ...       14084                  2          0
2    2539329        1    prior  ...       12427                  3          0
3    2539329        1    prior  ...       26088                  4          0
4    2539329        1    prior  ...       26405                  5          0
5    2398795        1    prior  ...         196                  1          1
6    2398795        1    prior  ...       10258                  2          0
7    2398795        1    prior  ...       12427                  3          1
8    2398795        1    prior  ...       13176                  4          0
9    2398795        1    prior  ...       26088                  5          1
10   2398795        1    prior  ...       13032                  6          0

[11 rows x 10 columns]

In [54]:
display(example)

In [ ]:
# Remove columns that we don't need
order_and_products.drop(labels=['eval_set','days_since_prior_order','add'])

Okay, we're looking pretty good, we're missing one more column `product_name` so we're going to need to merge one more time

1) merge `orders_and_products` with `products`

2) Use `product_id` as our identifier in both tables

3) We need to slim down the `products` dataframe

In [56]:
condition = (products['product_id']).isin(order_and_products['product_id'])
products_subset = products[condition]
products_subset

       product_id  ... department_id
195           196  ...             7
10257       10258  ...            19
12426       12427  ...            19
13031       13032  ...            14
13175       13176  ...             4
14083       14084  ...            16
26087       26088  ...            19
26404       26405  ...            17

[8 rows x 4 columns]

In [58]:
final = pd.merge(products_subset,order_and_products,on='product_id',how='inner')

In [65]:
final = final.drop(['aisle_id','department_id','eval_set','reordered'],axis=1)

KeyError: ignored

In [68]:
final=final.drop('days_since_prior_order')

KeyError: ignored

In [69]:
display(example)

### Some nitpicky cleanup:

In [71]:
# sort rows
final = final.sort_values(by = ['order_number','add_to_cart_order'])

In [72]:
# reorder columns
final = final[['user_id', 'order_id', 'order_number','order_dow', 'order_hour_of_day', 'add_to_cart_order', 'product_id', 'product_name']]

final

    user_id  order_id  ...  product_id                             product_name
0         1   2539329  ...         196                                     Soda
7         1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
3         1   2539329  ...       12427                      Original Beef Jerky
8         1   2539329  ...       26088               Aged White Cheddar Popcorn
10        1   2539329  ...       26405         XL Pick-A-Size Paper Towel Rolls
1         1   2398795  ...         196                                     Soda
2         1   2398795  ...       10258                               Pistachios
4         1   2398795  ...       12427                      Original Beef Jerky
6         1   2398795  ...       13176                   Bag of Organic Bananas
9         1   2398795  ...       26088               Aged White Cheddar Popcorn
5         1   2398795  ...       13032                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [74]:
# remove underscores from column headers
final.columns = [column.replace('_',' ') for column in final]
final

    user id  order id  ...  product id                             product name
0         1   2539329  ...         196                                     Soda
7         1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
3         1   2539329  ...       12427                      Original Beef Jerky
8         1   2539329  ...       26088               Aged White Cheddar Popcorn
10        1   2539329  ...       26405         XL Pick-A-Size Paper Towel Rolls
1         1   2398795  ...         196                                     Soda
2         1   2398795  ...       10258                               Pistachios
4         1   2398795  ...       12427                      Original Beef Jerky
6         1   2398795  ...       13176                   Bag of Organic Bananas
9         1   2398795  ...       26088               Aged White Cheddar Popcorn
5         1   2398795  ...       13032                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [77]:
final.reset_index()

    index  user id  ...  product id                             product name
0       0        1  ...         196                                     Soda
1       7        1  ...       14084  Organic Unsweetened Vanilla Almond Milk
2       3        1  ...       12427                      Original Beef Jerky
3       8        1  ...       26088               Aged White Cheddar Popcorn
4      10        1  ...       26405         XL Pick-A-Size Paper Towel Rolls
5       1        1  ...         196                                     Soda
6       2        1  ...       10258                               Pistachios
7       4        1  ...       12427                      Original Beef Jerky
8       6        1  ...       13176                   Bag of Organic Bananas
9       9        1  ...       26088               Aged White Cheddar Popcorn
10      5        1  ...       13032                    Cinnamon Toast Crunch

[11 rows x 9 columns]

In [81]:
display(example)

## Challenge

Review this Chis Albon documentation about [concatenating dataframes by row and by column](https://chrisalbon.com/python/data_wrangling/pandas_join_merge_dataframe/) and then be ready to master this function and practice using different `how` parameters on your assignment.

# [Objective 3](#tidy) - Learn Tidy Data Format

## Overview

### Why reshape data?

#### Some libraries prefer data in different formats

For example, the Seaborn data visualization library prefers data in "Tidy" format often (but not always).

> "[Seaborn will be most powerful when your datasets have a particular organization.](https://seaborn.pydata.org/introduction.html#organizing-datasets) This format ia alternately called “long-form” or “tidy” data and is described in detail by Hadley Wickham. The rules can be simply stated:

> - Each variable is a column
- Each observation is a row

> A helpful mindset for determining whether your data are tidy is to think backwards from the plot you want to draw. From this perspective, a “variable” is something that will be assigned a role in the plot."

#### Data science is often about putting square pegs in round holes

Here's an inspiring [video clip from _Apollo 13_](https://www.youtube.com/watch?v=ry55--J4_VQ): “Invent a way to put a square peg in a round hole.” It's a good metaphor for data wrangling!